---
kind: type
id: T:Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs
source: html/b803dfe4-f87c-ec59-a04c-89900c74bd10.htm
---
# Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs

The event arguments used by DisplayingOptionDialog event.

## Syntax (C#)
```csharp
public class DisplayingOptionsDialogEventArgs : RevitAPIPreEventArgs
```